Documents/ESB/ESB_Consumer_0903/003TestSample/SAMPLE_XML_MUST/CustomerTax/CT04_CrAdjIntrstAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CustomerTax/CrAdjIntrstAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CustomerTax</ServiceDomain>  
      <OperationName>CrAdjIntrstAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CrAdjIntrstAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CT04</v11:TxnId>  
        <v11:TxnNo>CT0400001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--1 or more repetitions:-->  
        <v11:AcctNoRec> 
          <v11:AcctNo>STR</v11:AcctNo> 
        </v11:AcctNoRec>  
        <!--1 or more repetitions:-->  
        <v11:PmtDateRec> 
          <v11:PmtDate>STR</v11:PmtDate> 
        </v11:PmtDateRec>  
        <!--1 or more repetitions:-->  
        <v11:PmtAmtRec> 
          <v11:PmtAmt>12.0</v11:PmtAmt> 
        </v11:PmtAmtRec>  
        <!--1 or more repetitions:-->  
        <v11:InstrstTypeRec> 
          <v11:InstrstType>STR</v11:InstrstType> 
        </v11:InstrstTypeRec>  
        <!--1 or more repetitions:-->  
        <v11:SeqNoRec> 
          <v11:SeqNo>01</v11:SeqNo> 
        </v11:SeqNoRec>  
        <v11:CrAcctNo>STR</v11:CrAcctNo>  
        <v11:CrCcy>STR</v11:CrCcy>  
        <!--Zero or more repetitions:-->  
        <v11:DbRefDataRec></v11:DbRefDataRec>  
        <!--Zero or more repetitions:-->  
        <v11:CrRefDataRec></v11:CrRefDataRec>  
        <!--Zero or more repetitions:-->  
        <v11:DbMemoRec></v11:DbMemoRec>  
        <!--Zero or more repetitions:-->  
        <v11:CrMemoRec></v11:CrMemoRec>  
        <!--Optional:-->  
        <v11:IPAddr>IP.172.20.15.192</v11:IPAddr>  
        <!--Optional:-->  
        <v11:DevNo>1</v11:DevNo>  
        <!--Optional:-->  
        <v11:EntryDeptCode>N01</v11:EntryDeptCode>  
        <!--Optional:-->  
        <v11:PrftCntr>N01</v11:PrftCntr>  
        <!--Optional:-->  
        <v11:CostCntr>N01</v11:CostCntr>  
        <!--Optional:-->  
        <v11:AuthEmpId>HELEN</v11:AuthEmpId>  
        <!--Optional:-->  
        <v11:EntryEmplNo>HELEN</v11:EntryEmplNo>  
        <!--Optional:-->  
        <v11:VerName>AA.ARRANGEMENT.ACTIVITY,AA.API.NEW.NCB.1.0.0</v11:VerName>  
        <!--Optional:-->  
        <v11:EcoUnit>N01</v11:EcoUnit>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF01010</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:CrAdjIntrstAddRq> 
  </soap:Body> 
</soap:Envelope>
